Revit 2027 API
ParameterTypeId.RebarSystemHookTypeTopDirn1 Property
 "Top Major Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookTypeTopDirn1 { get; }
Public Shared ReadOnly Property RebarSystemHookTypeTopDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookTypeTopDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookTypeTopDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace